; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
)
(:goal (and
	(have_image Phenomenon5 infrared0)
	(have_image Phenomenon6 infrared0)
	(have_image Star7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Star10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 planet11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
5. (take_image satellite0 planet11 instrument2 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon6 instrument2 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon5 instrument2 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon12 instrument2 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 4 of 9
12. (turn_to satellite0 planet8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet8)
   goals met: 4 of 9
13. (take_image satellite0 planet8 instrument2 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 5 of 9
14. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 5 of 9
15. (take_image satellite0 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 9
16. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 6 of 9
17. (take_image satellite0 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 7 of 9
18. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 7 of 9
19. (take_image satellite0 star13 instrument2 infrared0)
   added: (have_image star13 infrared0)
   goals met: 8 of 9
20. (turn_to satellite0 star7 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star7)
   goals met: 8 of 9
21. (take_image satellite0 star7 instrument2 infrared0)
   added: (have_image star7 infrared0)
   goals met: 9 of 9
